# Encoding Categorical Variables

In [33]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [35]:
dataset = pd.read_csv('Dataset salary 2024.csv')

In [37]:
dataset.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M

# Label Encoding

In [38]:
# Initialize the LabelEncoder
label_encoder = LabelEncoder()

In [39]:
# Loop through each column in the DataFrame
for column in dataset.columns:
    if dataset[column].dtype == 'object':  
        dataset[column] = label_encoder.fit_transform(dataset[column])

In [41]:
dataset.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,3,2,2,202730,21,202730,84,0,74,1
1,2024,3,2,2,92118,21,92118,84,0,74,1
2,2024,3,2,57,130500,21,130500,84,0,74,1
3,2024,3,2,57,96000,21,96000,84,0,74,1
4,2024,3,2,120,190000,21,190000,84,0,74,1

In [43]:
from sklearn.preprocessing import MinMaxScaler

In [44]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16534 non-null  int64
 1   experience_level    16534 non-null  int32
 2   employment_type     16534 non-null  int32
 3   job_title           16534 non-null  int32
 4   salary              16534 non-null  int64
 5   salary_currency     16534 non-null  int32
 6   salary_in_usd       16534 non-null  int64
 7   employee_residence  16534 non-null  int32
 8   remote_ratio        16534 non-null  int64
 9   company_location    16534 non-null  int32
 10  company_size        16534 non-null  int32
dtypes: int32(7), int64(4)
memory usage: 968.9 KB

In [46]:
# Initialize the MinMaxScaler
min_max_scaler = MinMaxScaler()
dataset = min_max_scaler.fit_transform(dataset)

In [47]:
print(dataset)

[[1.         1.         0.66666667 ... 0.         0.97368421 0.5       ]
 [1.         1.         0.66666667 ... 0.         0.97368421 0.5       ]
 [1.         1.         0.66666667 ... 0.         0.97368421 0.5       ]
 ...
 [0.         0.         0.66666667 ... 1.         0.97368421 1.        ]
 [0.         0.         0.         ... 1.         0.97368421 0.        ]
 [0.25       1.         0.66666667 ... 0.5        0.5        0.        ]]